docs/load-test-results/2026-06-23-k6-500-users/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: .\load-test\k6\scripts\practice-reservation-flow.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 6m35s max duration (incl. graceful stop):
              * reservation_flow: 1 iterations for each of 500 VUs (maxDuration: 6m5s, gracefulStop: 30s)


Init               [  67% ] 336/500 VUs initialized
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

running (0m42.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m00.9s/6m5s  000/500 iters, 1 per VU

running (0m43.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m01.9s/6m5s  000/500 iters, 1 per VU

running (0m44.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m02.9s/6m5s  000/500 iters, 1 per VU

running (0m45.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m03.9s/6m5s  000/500 iters, 1 per VU

running (0m46.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m04.9s/6m5s  000/500 iters, 1 per VU

running (0m47.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m05.9s/6m5s  000/500 iters, 1 per VU

running (0m48.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m06.9s/6m5s  000/500 iters, 1 per VU

running (0m49.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m07.9s/6m5s  000/500 iters, 1 per VU

running (0m50.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m08.9s/6m5s  000/500 iters, 1 per VU

running (0m51.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m09.9s/6m5s  000/500 iters, 1 per VU

running (0m52.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m10.9s/6m5s  000/500 iters, 1 per VU

running (0m53.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m11.9s/6m5s  000/500 iters, 1 per VU

running (0m54.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m12.9s/6m5s  000/500 iters, 1 per VU

running (0m55.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m13.9s/6m5s  000/500 iters, 1 per VU

running (0m56.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m14.9s/6m5s  000/500 iters, 1 per VU

running (0m57.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m15.9s/6m5s  000/500 iters, 1 per VU

running (0m58.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m16.9s/6m5s  000/500 iters, 1 per VU

running (0m59.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m17.9s/6m5s  000/500 iters, 1 per VU

running (1m00.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m18.9s/6m5s  000/500 iters, 1 per VU

running (1m01.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m19.9s/6m5s  000/500 iters, 1 per VU

running (1m02.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m20.9s/6m5s  000/500 iters, 1 per VU

running (1m03.7s), 500/500 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 500 VUs  0m21.9s/6m5s  000/500 iters, 1 per VU

running (1m04.7s), 496/500 VUs, 4 complete and 0 interrupted iterations
reservation_flow   [   1% ] 500 VUs  0m22.9s/6m5s  004/500 iters, 1 per VU

running (1m05.7s), 485/500 VUs, 15 complete and 0 interrupted iterations
reservation_flow   [   3% ] 500 VUs  0m23.9s/6m5s  015/500 iters, 1 per VU

running (1m06.7s), 442/500 VUs, 58 complete and 0 interrupted iterations
reservation_flow   [  12% ] 500 VUs  0m24.9s/6m5s  058/500 iters, 1 per VU

running (1m07.7s), 412/500 VUs, 88 complete and 0 interrupted iterations
reservation_flow   [  18% ] 500 VUs  0m25.9s/6m5s  088/500 iters, 1 per VU

running (1m08.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m26.9s/6m5s  100/500 iters, 1 per VU

running (1m09.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m27.9s/6m5s  100/500 iters, 1 per VU

running (1m10.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m28.9s/6m5s  100/500 iters, 1 per VU

running (1m11.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m29.9s/6m5s  100/500 iters, 1 per VU

running (1m12.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m30.9s/6m5s  100/500 iters, 1 per VU

running (1m13.7s), 400/500 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m31.9s/6m5s  100/500 iters, 1 per VU

running (1m14.7s), 399/500 VUs, 101 complete and 0 interrupted iterations
reservation_flow   [  20% ] 500 VUs  0m32.9s/6m5s  101/500 iters, 1 per VU

running (1m15.7s), 397/500 VUs, 103 complete and 0 interrupted iterations
reservation_flow   [  21% ] 500 VUs  0m33.9s/6m5s  103/500 iters, 1 per VU

running (1m16.7s), 391/500 VUs, 109 complete and 0 interrupted iterations
reservation_flow   [  22% ] 500 VUs  0m34.9s/6m5s  109/500 iters, 1 per VU

running (1m17.7s), 389/500 VUs, 111 complete and 0 interrupted iterations
reservation_flow   [  22% ] 500 VUs  0m35.9s/6m5s  111/500 iters, 1 per VU

running (1m18.7s), 386/500 VUs, 114 complete and 0 interrupted iterations
reservation_flow   [  23% ] 500 VUs  0m36.9s/6m5s  114/500 iters, 1 per VU

running (1m19.7s), 384/500 VUs, 116 complete and 0 interrupted iterations
reservation_flow   [  23% ] 500 VUs  0m37.9s/6m5s  116/500 iters, 1 per VU

running (1m20.7s), 378/500 VUs, 122 complete and 0 interrupted iterations
reservation_flow   [  24% ] 500 VUs  0m38.9s/6m5s  122/500 iters, 1 per VU

running (1m21.7s), 338/500 VUs, 162 complete and 0 interrupted iterations
reservation_flow   [  32% ] 500 VUs  0m39.9s/6m5s  162/500 iters, 1 per VU

running (1m22.7s), 306/500 VUs, 194 complete and 0 interrupted iterations
reservation_flow   [  39% ] 500 VUs  0m40.9s/6m5s  194/500 iters, 1 per VU

running (1m23.7s), 302/500 VUs, 198 complete and 0 interrupted iterations
reservation_flow   [  40% ] 500 VUs  0m41.9s/6m5s  198/500 iters, 1 per VU

running (1m24.7s), 300/500 VUs, 200 complete and 0 interrupted iterations
reservation_flow   [  40% ] 500 VUs  0m42.9s/6m5s  200/500 iters, 1 per VU

running (1m25.7s), 300/500 VUs, 200 complete and 0 interrupted iterations
reservation_flow   [  40% ] 500 VUs  0m43.9s/6m5s  200/500 iters, 1 per VU

running (1m26.7s), 299/500 VUs, 201 complete and 0 interrupted iterations
reservation_flow   [  40% ] 500 VUs  0m44.9s/6m5s  201/500 iters, 1 per VU

running (1m27.7s), 290/500 VUs, 210 complete and 0 interrupted iterations
reservation_flow   [  42% ] 500 VUs  0m45.9s/6m5s  210/500 iters, 1 per VU

running (1m28.7s), 282/500 VUs, 218 complete and 0 interrupted iterations
reservation_flow   [  44% ] 500 VUs  0m46.9s/6m5s  218/500 iters, 1 per VU

running (1m29.7s), 271/500 VUs, 229 complete and 0 interrupted iterations
reservation_flow   [  46% ] 500 VUs  0m47.9s/6m5s  229/500 iters, 1 per VU

running (1m30.7s), 245/500 VUs, 255 complete and 0 interrupted iterations
reservation_flow   [  51% ] 500 VUs  0m48.9s/6m5s  255/500 iters, 1 per VU

running (1m31.7s), 209/500 VUs, 291 complete and 0 interrupted iterations
reservation_flow   [  58% ] 500 VUs  0m49.9s/6m5s  291/500 iters, 1 per VU

running (1m32.7s), 200/500 VUs, 300 complete and 0 interrupted iterations
reservation_flow   [  60% ] 500 VUs  0m50.9s/6m5s  300/500 iters, 1 per VU

running (1m33.7s), 195/500 VUs, 305 complete and 0 interrupted iterations
reservation_flow   [  61% ] 500 VUs  0m51.9s/6m5s  305/500 iters, 1 per VU

running (1m34.7s), 195/500 VUs, 305 complete and 0 interrupted iterations
reservation_flow   [  61% ] 500 VUs  0m52.9s/6m5s  305/500 iters, 1 per VU

running (1m35.7s), 193/500 VUs, 307 complete and 0 interrupted iterations
reservation_flow   [  61% ] 500 VUs  0m53.9s/6m5s  307/500 iters, 1 per VU

running (1m36.7s), 185/500 VUs, 315 complete and 0 interrupted iterations
reservation_flow   [  63% ] 500 VUs  0m54.9s/6m5s  315/500 iters, 1 per VU

running (1m37.7s), 184/500 VUs, 316 complete and 0 interrupted iterations
reservation_flow   [  63% ] 500 VUs  0m55.9s/6m5s  316/500 iters, 1 per VU

running (1m38.7s), 182/500 VUs, 318 complete and 0 interrupted iterations
reservation_flow   [  64% ] 500 VUs  0m56.9s/6m5s  318/500 iters, 1 per VU

running (1m39.7s), 160/500 VUs, 340 complete and 0 interrupted iterations
reservation_flow   [  68% ] 500 VUs  0m57.9s/6m5s  340/500 iters, 1 per VU

running (1m40.7s), 117/500 VUs, 383 complete and 0 interrupted iterations
reservation_flow   [  77% ] 500 VUs  0m58.9s/6m5s  383/500 iters, 1 per VU

running (1m41.7s), 087/500 VUs, 413 complete and 0 interrupted iterations
reservation_flow   [  83% ] 500 VUs  0m59.9s/6m5s  413/500 iters, 1 per VU

running (1m42.7s), 084/500 VUs, 416 complete and 0 interrupted iterations
reservation_flow   [  83% ] 500 VUs  1m00.9s/6m5s  416/500 iters, 1 per VU

running (1m43.7s), 080/500 VUs, 420 complete and 0 interrupted iterations
reservation_flow   [  84% ] 500 VUs  1m01.9s/6m5s  420/500 iters, 1 per VU

running (1m44.7s), 076/500 VUs, 424 complete and 0 interrupted iterations
reservation_flow   [  85% ] 500 VUs  1m02.9s/6m5s  424/500 iters, 1 per VU

running (1m45.7s), 059/500 VUs, 441 complete and 0 interrupted iterations
reservation_flow   [  88% ] 500 VUs  1m03.9s/6m5s  441/500 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration{name:practice.payment.complete}
    ✗ 'p(95)<1500' p(95)=2.16s
    ✓ 'p(99)<3000' p(99)=2.53s

    http_req_duration{name:practice.queue.enter}
    ✗ 'p(95)<1000' p(95)=2.63s
    ✗ 'p(99)<2000' p(99)=2.86s

    http_req_duration{name:practice.queue.join}
    ✗ 'p(95)<1000' p(95)=2.21s
    ✗ 'p(99)<2000' p(99)=2.31s

    http_req_duration{name:practice.reservation.create}
    ✗ 'p(95)<1500' p(95)=2.69s
    ✗ 'p(99)<3000' p(99)=3.02s

    http_req_duration{name:practice.seats.hold}
    ✗ 'p(95)<1500' p(95)=3.04s
    ✗ 'p(99)<3000' p(99)=3.33s

    http_req_duration{name:practice.seats}
    ✗ 'p(95)<1500' p(95)=3.22s
    ✗ 'p(99)<3000' p(99)=3.68s

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8775    82.840917/s
    checks_succeeded...: 100.00% 8775 out of 8775
    checks_failed......: 0.00%   0 out of 8775

    ✓ practice.queue.session.create status is 2xx
    ✓ practice.queue.join status is 2xx
    ✓ practice.queue.me status is 2xx
    ✓ practice.queue.enter status is 2xx
    ✓ practice.sections status is 2xx
    ✓ practice.seats status is 2xx
    ✓ practice.reservation.create status is 2xx
    ✓ practice.payment.request status is 2xx
    ✓ practice.queue.heartbeat status is 2xx
    ✓ practice.payment.complete status is 2xx
    ✓ practice.reservation.get status is 2xx

    CUSTOM
    practice_reservation_flow_duration_ms....: avg=41202.734 min=17251    med=43430  p(90)=58547.6 p(95)=58656.05 p(99)=58705.51 max=58807
    reservation_confirmed....................: 500    4.72028/s
    seat_hold_retry_conflict.................: 6      0.056643/s

    HTTP
    http_req_duration........................: avg=1.41s     min=11.29ms  med=1.42s  p(90)=2.32s   p(95)=2.67s    p(99)=3.1s     max=3.8s 
      { expected_response:true }.............: avg=1.41s     min=11.29ms  med=1.42s  p(90)=2.32s   p(95)=2.67s    p(99)=3.1s     max=3.8s 
      { name:practice.payment.complete }.....: avg=1.14s     min=152.44ms med=1.12s  p(90)=2.01s   p(95)=2.16s    p(99)=2.53s    max=3.03s
      { name:practice.queue.enter }..........: avg=1.41s     min=23.17ms  med=1.32s  p(90)=2.41s   p(95)=2.63s    p(99)=2.86s    max=3.17s
      { name:practice.queue.join }...........: avg=1.56s     min=216.52ms med=1.68s  p(90)=2s      p(95)=2.21s    p(99)=2.31s    max=2.43s
      { name:practice.reservation.create }...: avg=1.39s     min=131.93ms med=1.35s  p(90)=2.4s    p(95)=2.69s    p(99)=3.02s    max=3.17s
      { name:practice.seats.hold }...........: avg=1.52s     min=61.96ms  med=1.18s  p(90)=2.9s    p(95)=3.04s    p(99)=3.33s    max=3.58s
      { name:practice.seats }................: avg=1.76s     min=217.24ms med=1.57s  p(90)=2.98s   p(95)=3.22s    p(99)=3.68s    max=3.8s 
    http_req_failed..........................: 0.00%  0 out of 9781
    http_reqs................................: 9781   92.33812/s

    EXECUTION
    iteration_duration.......................: avg=46.47s    min=22.53s   med=48.68s p(90)=1m3s    p(95)=1m4s     p(99)=1m4s     max=1m4s 
    iterations...............................: 500    4.72028/s
    vus......................................: 59     min=0         max=500
    vus_max..................................: 500    min=335       max=500

    NETWORK
    data_received............................: 112 MB 1.1 MB/s
    data_sent................................: 2.6 MB 25 kB/s



running (1m45.9s), 000/500 VUs, 500 complete and 0 interrupted iterations
reservation_flow ✓ [ 100% ] 500 VUs  1m04.1s/6m5s  500/500 iters, 1 per VU